{
  "title": "Shipment Control",
  "subTitle": "Revolutionize your shipment operations with our Shipment Management System. This module is built to streamline every aspect of shipment control, from routing to compliance enforcement, ensuring efficient and reliable management of your transport operations.",
  "formSuccessMessage": "Shipment Control updated successfully.",
  "formErrorMessage": "Failed to update shipment control.",
  "fields": {
    "autoRateShipment": {
      "label": "Auto Rate Shipment",
      "description": "Automate the rating of shipments based on pre-established contractual rates."
    },
    "calculateDistance": {
      "label": "Calculate Distance",
      "description": "Enable automatic calculation of shipment distances for accurate logistics planning."
    },
    "enforceRevCode": {
      "label": "Enforce Revenue code",
      "description": "Mandate the use of specific revenue codes for standardized shipment billing."
    },
    "enforceVoidedComm": {
      "label": "Enforce Voided Comm",
      "description": "Implement checks against using voided commodity codes in shipment processing."
    },
    "generateRoutes": {
      "label": "Generate Routes",
      "description": "Automatically generate optimal routes for each shipment to enhance efficiency."
    },
    "enforceCommodity": {
      "label": "Enforce Commodity",
      "description": "Require the use of commodity codes for all shipments for consistent categorization."
    },
    "autoSequenceStops": {
      "label": "Auto Sequence Stops",
      "description": "Automatically organize the sequence of stops in a shipment for optimal routing."
    },
    "autoShipmentTotal": {
      "label": "Auto Calc. Shipment Total",
      "description": "Automatically calculate the total charge for shipments, ensuring billing accuracy."
    },
    "enforceOriginDestination": {
      "label": "Compare Origin/Destination",
      "description": "Validate that the origin and destination of each shipment are distinct."
    },
    "checkForDuplicateBol": {
      "label": "Check for Duplicate BOL",
      "description": "Check for and prevent duplicate Bill of Lading (BOL) numbers in the system."
    },
    "removeShipment": {
      "label": "Remove Shipment",
      "description": "Grant the ability to remove shipments from the system, with restrictions on active movements and stops."
    },
    "sendPlacardInfo": {
      "label": "Send Placard Info",
      "description": "Automatically send placard information to drivers for hazardous shipments."
    },
    "enforceHazmatSegRules": {
      "label": "Enforce Hazmat Seg. Rules",
      "description": "Enforce compliance with hazardous materials shipping regulations."
    }
  }
}
