{
    "title": "Create New Table Change Alert",
    "subTitle": "Use this form to add a new table change alert to the system.",
    "formMessages": {
        "postSuccess": "Table Change Alert saved successfully.",
        "postError": "There was an error saving the table change alert.",
        "updateSuccess": "Email profile updated successfully.",
        "updateError": "There was an error updating the table change alert."
    },
    "fields": {
        "status": {
            "placeholder": "Status",
            "label": "Status",
            "description": "Indicates the current state of the table change alert. Reflects the operational status within the system."
        },
        "name": {
            "placeholder": "Name",
            "label": "Name",
            "description": "A unique identifier for the table change alert. This name helps in easily referencing and managing the alert."
        },
        "databaseAction": {
            "placeholder": "Database Action",
            "label": "Database Action",
            "description": "Specifies the type of database operation that triggers the alert."
        },
        "source": {
            "placeholder": "Source",
            "label": "Source",
            "description": "Identifies the origin or the data source for the table change alert, such as a specific database or data stream."
        },
        "topic": {
            "placeholder": "Topic",
            "label": "Topic",
            "description": "Defines the main subject or the table name associated with the alert. This field usually aligns with the specific table being monitored."
        },
        "table": {
            "placeholder": "Table",
            "label": "Table",
            "description": "The exact name of the database table to which the alert is attached. Changes in this table trigger the alert."
        },
        "description": {
            "placeholder": "Description",
            "label": "Description",
            "description": "A detailed explanation of the table change alert's purpose, scope, and any relevant details. This helps users understand the alert's context."
        },
        "emailProfile": {
            "placeholder": "Email Profile",
            "label": "Email Profile",
            "description": "Refers to the configured email settings profile used for sending out the alerts. This includes sender information and SMTP settings."
        },
        "emailRecipients": {
            "placeholder": "Email Recipients",
            "label": "Email Recipients",
            "description": "A list of email addresses, separated by commas, that will receive notifications. These recipients are alerted upon the specified database action."
        },
        "effectiveDate": {
            "placeholder": "Effective Date",
            "label": "Effective Date",
            "description": "The start date from which the table change alert becomes active."
        },
        "expirationDate": {
            "placeholder": "Expiration Date",
            "label": "Expiration Date",
            "description": "The date after which the table change alert becomes inactive."
        }
    }
}