{
  "title": "Google API",
  "subTitle": "Empower your dispatch system with Google API integration. Configure settings for advanced routing, precise geocoding, and dynamic map views to streamline your fleet management. Enhance route planning, location accuracy, and visual data representation for an optimal operational experience.",
  "formSuccessMessage": "Google API settings updated successfully.",
  "formErrorMessage": "Failed to update Google API settings.",
  "fields": {
    "mileageUnit": {
      "label": "Mileage Unit",
      "placeholder": "Mileage Unit",
      "description": "Select the unit of measurement for mileage to ensure accurate distance tracking across different regions."
    },
    "trafficModel": {
      "label": "Traffic Model",
      "placeholder": "Traffic Model",
      "description": "Choose a traffic model for enhanced route calculation, factoring in real-time traffic conditions for optimal routing."
    },
    "apiKey": {
      "label": "Google API Key",
      "placeholder": "API Key",
      "description": "Securely input your Google API Key to access and integrate Google's mapping services."
    },
    "addCustomerLocation": {
      "label": "Add Customer Location",
      "description": "Enable this to utilize and enforce the usage of the Google Places API for adding customer locations, ensuring accurate and standardized data entry."
    },
    "addLocation": {
      "label": "Add Location",
      "description": "Activate to mandate the use of the Google Places API when adding new locations, promoting consistency and precision in location data."
    },
    "autoGeocode": {
      "label": "Auto Geocode",
      "description": "Automatically convert addresses into geographical coordinates for accurate and hassle-free location mapping."
    }
  },
  "alert": {
    "title": "Information!",
    "list": {
      "apiKey": {
        "link": "Google's API Key Documentation",
        "description": "<strong>Google API Key:</strong> Required to access Google's mapping services, including routing and geocoding. Ensure you have the correct API permissions and billing set up in your Google Cloud Platform account. For more details, see "
      },
      "mileageUnit": {
        "link": "Google's Unit Systems Documentation",
        "description": "<strong>Mileage Unit:</strong> Choose the unit for distance measurement (e.g., imperial, metric). For more details, see "
      },
      "trafficModel": {
        "link": "Google's Traffic Model Documentation",
        "description": "<strong>Traffic Model:</strong> Determines how traffic conditions affect route calculation. For more details, see "
      }
    }
  }
}
