{
    "title": "Manage Your Organization Information",
    "subTitle": "Keep your organization's profile up to date. This section allows you to maintain accurate information about your organization, which is crucial for efficient management, communication, and service delivery within the transportation management system. We are committed to safeguarding your data. For more information on our data handling practices, please review our Privacy Policy.",
    "organizationDetails": "General Information",
    "organizationDetailsDescription": "Essential for operational efficiency and compliance, this section captures your organization's core details. Accurate information ensures effective communication and customized service in the transportation sector.",
    "formSuccessMessage": "Organization updated successfully.",
    "formErrorMessage": "Failed to update organization.",
    "fields": {
      "logo": {
        "placeholder": "Change Logo",
        "description": "JPG, WEBP or PNG. 1MB max."
      },
      "name": {
        "placeholder": "Name",
        "label": "Name",
        "description": "Enter the official name of your organization. This name will be used in all system communications and documents."
      },
      "orgType": {
        "placeholder": "Organization Type",
        "label": "Organization Type",
        "description": "Specify the nature of your organization's operations. Choose 'Asset' for asset-based operations, 'Brokerage' for brokerage services, or 'Both' if your organization handles both operations."
      },
      "scacCode": {
        "placeholder": "SCAC Code",
        "label": "SCAC Code",
        "description": "Input your Standard Carrier Alpha Code. This unique code is vital for identifying your organization in transport-related activities."
      },
      "dotNumber": {
        "placeholder": "DOT Number",
        "label": "DOT Number",
        "description": "Provide your Department of Transportation number. This unique identifier is critical for legal and regulatory compliance in transportation."
      },
      "addressLine1": {
        "placeholder": "Address Line 1",
        "label": "Address Line 1",
        "description": "Specify the primary street address of your organization. This address is used for official correspondence and location-based services."
      },
      "addressLine2": {
        "placeholder": "Address Line 2",
        "label": "Address Line 2",
        "description": "Additional address information (if needed). Include suite numbers, building names, or other pertinent details."
      },
      "city": {
        "placeholder": "City",
        "label": "City",
        "description": "Enter the city where your organization is based."
      },
      "state": {
        "placeholder": "State",
        "label": "State",
        "description": "Select the state in which your organization operates."
      },
      "zipCode": {
        "placeholder": "Zip Code",
        "label": "Zip Code",
        "description": "Input the zip code of your organization's primary location."
      },
      "phoneNumber": {
        "placeholder": "Phone Number",
        "label": "Phone Number",
        "description": "Your organization's primary contact number. This will be used for official communications and urgent contacts."
      },
      "website": {
        "placeholder": "Website",
        "label": "Website",
        "description": "The official website of your organization. It will be referenced in your profile and used for digital communications."
      },
      "language": {
        "placeholder": "Language",
        "label": "Language",
        "description": "Choose the primary language used in your organization. This facilitates effective communication and system localization."
      },
      "currency": {
        "placeholder": "Currency",
        "label": "Currency",
        "description": "Specify the currency used for your financial transactions. This ensures accurate financial management within the system."
      },
      "dateFormat": {
        "placeholder": "Date Format",
        "label": "Date Format",
        "description": "Select the date format preferred by your organization. This setting will apply to all date references in the system."
      },
      "timeFormat": {
        "placeholder": "Time Format",
        "label": "Time Format",
        "description": "Choose the time format for your organization's operations. This affects how time is displayed across the system's interfaces."
      },
      "timezone": {
        "placeholder": "Timezone",
        "label": "Timezone",
        "description": "Set the timezone corresponding to your organization’s primary operation area. Accurate timezone settings are essential for synchronized scheduling and coordination in transportation activities."
      }
    }
}